In [1]:
import pandas as pd

In [2]:
car_sales = pd.read_csv("car-sales.csv")

In [3]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

 ## Viewing and selecting data

In [4]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [5]:
car_sales.head(6)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

In [6]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [7]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [8]:
# .loc and .iloc
animals = pd.Series(["cat","dog","bird","panda","snake"])

In [9]:
animals

0      cat
1      dog
2     bird
3    panda
4    snake
dtype: object

In [10]:
animals1 = pd.Series(["cat","dog","bird","panda","snake"],index = [0,3,9,8,3])

In [11]:
animals1

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [12]:
animals.loc[3] #loc is a short form of location,

'panda'

In [13]:
animals1.loc[3]

3      dog
3    snake
dtype: object

In [14]:
animals1.loc[9]

'bird'

In [15]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [16]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [17]:
# .iloc refers to position 
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [18]:
animals1.iloc[3]

'panda'

In [19]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# .loc and iloc
.loc[] refers to index and .iloc[] refers to position
can be used for slicing

In [20]:
animals1.loc[3]

3      dog
3    snake
dtype: object

In [21]:
animals1.iloc[3]

'panda'

In [24]:
animals1

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [23]:
animals1.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [25]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [27]:
car_sales.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [31]:
animals1.loc[:8]

0      cat
3      dog
9     bird
8    panda
dtype: object

 # iloc and loc slicing
    iloc slicing will give upto columns whereas loc slicing will give upto specified index position 
    ex : iloc[:3] will give 3 columns 
         loc[:3] will give columns upto 3 index number
         it works just like python slicing

In [35]:
car_sales.loc[1:7:2]  #loc[start:end:step]

     Make Colour  Odometer (KM)  Doors       Price
1   Honda    Red          87899      4   $5,000.00
3     BMW  Black          11179      5  $22,000.00
5  Toyota  Green          99213      4   $4,500.00
7   Honda   Blue          54738      4   $7,000.00

In [37]:
car_sales.loc[0:8:2] #doesnot include 7th element

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
4  Nissan  White         213095      4  $3,500.00
6   Honda   Blue          45698      4  $7,500.00
8  Toyota  White          60000      4  $6,250.00

In [38]:
car_sales.iloc[0:8:2]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
4  Nissan  White         213095      4  $3,500.00
6   Honda   Blue          45698      4  $7,500.00